AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_adc.h
// Select power mode to enter between active scans.
#define AM_REG_ADC_CFG_LPMODE_S                      3
#define AM_REG_ADC_CFG_LPMODE_M                      0x00000018
#define AM_REG_ADC_CFG_LPMODE(n)                     (((uint32_t)(n) << 3) & 0x00000018)
#define AM_REG_ADC_CFG_LPMODE_MODE0                  0x00000000
#define AM_REG_ADC_CFG_LPMODE_MODE1                  0x00000008
#define AM_REG_ADC_CFG_LPMODE_MODE2                  0x00000010
#define AM_REG_ADC_CFG_LPMODE_MODE_UNDEFINED         0x00000018

// This bit enables Repeating Scan Mode.
#define AM_REG_ADC_CFG_RPTEN_S                       2
#define AM_REG_ADC_CFG_RPTEN_M                       0x00000004
#define AM_REG_ADC_CFG_RPTEN(n)                      (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_ADC_CFG_RPTEN_SINGLE_SCAN             0x00000000
#define AM_REG_ADC_CFG_RPTEN_REPEATING_SCAN          0x00000004

// This enables power to the temperature sensor module.  After setting this bit,
// the temperature sensor will remain powered down while the ADC is power is
// disconnected (i.e, when the ADC PWDSTAT is 2'b10).
#define AM_REG_ADC_CFG_TMPSPWR_S                     1
#define AM_REG_ADC_CFG_TMPSPWR_M                     0x00000002
#define AM_REG_ADC_CFG_TMPSPWR(n)                    (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_CFG_TMPSPWR_DIS                   0x00000000
#define AM_REG_ADC_CFG_TMPSPWR_EN                    0x00000002

// This bit enables the ADC module. While the ADC is enabled, the ADCCFG and
// SLOT Configuration regsiter settings must remain stable and unchanged.
#define AM_REG_ADC_CFG_ADCEN_S                       0
#define AM_REG_ADC_CFG_ADCEN_M                       0x00000001
#define AM_REG_ADC_CFG_ADCEN(n)                      (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_CFG_ADCEN_DIS                     0x00000000
#define AM_REG_ADC_CFG_ADCEN_EN                      0x00000001

//*****************************************************************************
//
// ADC_STAT - ADC Power Status
//
//*****************************************************************************
// Indicates the power-status of the ADC.
#define AM_REG_ADC_STAT_PWDSTAT_S                    0
#define AM_REG_ADC_STAT_PWDSTAT_M                    0x00000003
#define AM_REG_ADC_STAT_PWDSTAT(n)                   (((uint32_t)(n) << 0) & 0x00000003)
#define AM_REG_ADC_STAT_PWDSTAT_ON                   0x00000000
#define AM_REG_ADC_STAT_PWDSTAT_SWITCH_ON_SAR_OFF    0x00000001
#define AM_REG_ADC_STAT_PWDSTAT_POWER_SWITCH_OFF     0x00000002

//*****************************************************************************
//
// ADC_SWT - Software trigger
//
//*****************************************************************************
// Writing 0x37 to this register generates a software trigger.
#define AM_REG_ADC_SWT_SWT_S                         0
#define AM_REG_ADC_SWT_SWT_M                         0x000000FF
#define AM_REG_ADC_SWT_SWT(n)                        (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_ADC_SWT_SWT_GEN_SW_TRIGGER            0x00000037

//*****************************************************************************
//
// ADC_SL0CFG - Slot 0 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL0CFG_ADSEL0_S                   24
#define AM_REG_ADC_SL0CFG_ADSEL0_M                   0x07000000
#define AM_REG_ADC_SL0CFG_ADSEL0(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL0CFG_ADSEL0_AVG_128_MSRMTS      0x07000000

// Select the track and hold delay for this slot.  NOTE: The track and hold
// delay must be less than 50us for correct operation.  When the ADC is
// configured to use the 1.5Mhz clock, the track and hold delay cannot exceed 64
// clocks.
#define AM_REG_ADC_SL0CFG_THSEL0_S                   16
#define AM_REG_ADC_SL0CFG_THSEL0_M                   0x00070000
#define AM_REG_ADC_SL0CFG_THSEL0(n)                  (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_ADC_SL0CFG_THSEL0_1_ADC_CLK           0x00000000
#define AM_REG_ADC_SL0CFG_THSEL0_2_ADC_CLKS          0x00010000
#define AM_REG_ADC_SL0CFG_THSEL0_4_ADC_CLKS          0x00020000
#define AM_REG_ADC_SL0CFG_THSEL0_8_ADC_CLKS          0x00030000
#define AM_REG_ADC_SL0CFG_THSEL0_16_ADC_CLKS         0x00040000
#define AM_REG_ADC_SL0CFG_THSEL0_32_ADC_CLKS         0x00050000
#define AM_REG_ADC_SL0CFG_THSEL0_64_ADC_CLKS         0x00060000
#define AM_REG_ADC_SL0CFG_THSEL0_128_ADC_CLKS        0x00070000

// Select one of the 13 channel inputs for this slot.
#define AM_REG_ADC_SL0CFG_CHSEL0_S                   8
#define AM_REG_ADC_SL0CFG_CHSEL0_M                   0x00000F00
#define AM_REG_ADC_SL0CFG_CHSEL0(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL0CFG_CHSEL0_EXT0                0x00000000
#define AM_REG_ADC_SL0CFG_CHSEL0_EXT1                0x00000100
#define AM_REG_ADC_SL0CFG_CHSEL0_EXT2                0x00000200
#define AM_REG_ADC_SL0CFG_CHSEL0_EXT3                0x00000300
#define AM_REG_ADC_SL0CFG_CHSEL0_EXT4                0x00000400
#define AM_REG_ADC_SL0CFG_CHSEL0_EXT5                0x00000500
#define AM_REG_ADC_SL0CFG_CHSEL0_EXT6                0x00000600
#define AM_REG_ADC_SL0CFG_CHSEL0_EXT7                0x00000700
#define AM_REG_ADC_SL0CFG_CHSEL0_TEMP                0x00000800
#define AM_REG_ADC_SL0CFG_CHSEL0_VDD                 0x00000900
#define AM_REG_ADC_SL0CFG_CHSEL0_VSS                 0x00000A00
#define AM_REG_ADC_SL0CFG_CHSEL0_VBATT               0x00000C00

// This bit enables the window compare function for slot 0.
#define AM_REG_ADC_SL0CFG_WCEN0_S                    1
#define AM_REG_ADC_SL0CFG_WCEN0_M                    0x00000002
#define AM_REG_ADC_SL0CFG_WCEN0(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL0CFG_WCEN0_WCEN                 0x00000002

// This bit enables slot 0 for ADC conversions.
#define AM_REG_ADC_SL0CFG_SLEN0_S                    0
#define AM_REG_ADC_SL0CFG_SLEN0_M                    0x00000001
#define AM_REG_ADC_SL0CFG_SLEN0(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL0CFG_SLEN0_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL1CFG - Slot 1 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL1CFG_ADSEL1_S                   24
#define AM_REG_ADC_SL1CFG_ADSEL1_M                   0x07000000
#define AM_REG_ADC_SL1CFG_ADSEL1(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL1CFG_ADSEL1_AVG_128_MSRMTS      0x07000000

// Select the track and hold delay for this slot.  NOTE: The track and hold
// delay must be less than 50us for correct operation.  When the ADC is
// configured to use the 1.5 Mhz clock, the track and hold delay cannot exceed
// 64 clocks.
#define AM_REG_ADC_SL1CFG_THSEL1_S                   16
#define AM_REG_ADC_SL1CFG_THSEL1_M                   0x00070000
#define AM_REG_ADC_SL1CFG_THSEL1(n)                  (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_ADC_SL1CFG_THSEL1_1_ADC_CLK           0x00000000
#define AM_REG_ADC_SL1CFG_THSEL1_2_ADC_CLKS          0x00010000
#define AM_REG_ADC_SL1CFG_THSEL1_4_ADC_CLKS          0x00020000
#define AM_REG_ADC_SL1CFG_THSEL1_8_ADC_CLKS          0x00030000
#define AM_REG_ADC_SL1CFG_THSEL1_16_ADC_CLKS         0x00040000
#define AM_REG_ADC_SL1CFG_THSEL1_32_ADC_CLKS         0x00050000
#define AM_REG_ADC_SL1CFG_THSEL1_64_ADC_CLKS         0x00060000
#define AM_REG_ADC_SL1CFG_THSEL1_128_ADC_CLKS        0x00070000

