AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_adc.h
// Select one of the 13 channel inputs for this slot.
#define AM_REG_ADC_SL1CFG_CHSEL1_S                   8
#define AM_REG_ADC_SL1CFG_CHSEL1_M                   0x00000F00
#define AM_REG_ADC_SL1CFG_CHSEL1(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL1CFG_CHSEL1_EXT0                0x00000000
#define AM_REG_ADC_SL1CFG_CHSEL1_EXT1                0x00000100
#define AM_REG_ADC_SL1CFG_CHSEL1_EXT2                0x00000200
#define AM_REG_ADC_SL1CFG_CHSEL1_EXT3                0x00000300
#define AM_REG_ADC_SL1CFG_CHSEL1_EXT4                0x00000400
#define AM_REG_ADC_SL1CFG_CHSEL1_EXT5                0x00000500
#define AM_REG_ADC_SL1CFG_CHSEL1_EXT6                0x00000600
#define AM_REG_ADC_SL1CFG_CHSEL1_EXT7                0x00000700
#define AM_REG_ADC_SL1CFG_CHSEL1_TEMP                0x00000800
#define AM_REG_ADC_SL1CFG_CHSEL1_VDD                 0x00000900
#define AM_REG_ADC_SL1CFG_CHSEL1_VSS                 0x00000A00
#define AM_REG_ADC_SL1CFG_CHSEL1_VBATT               0x00000C00

// This bit enables the window compare function for slot 1.
#define AM_REG_ADC_SL1CFG_WCEN1_S                    1
#define AM_REG_ADC_SL1CFG_WCEN1_M                    0x00000002
#define AM_REG_ADC_SL1CFG_WCEN1(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL1CFG_WCEN1_WCEN                 0x00000002

// This bit enables slot 1 for ADC conversions.
#define AM_REG_ADC_SL1CFG_SLEN1_S                    0
#define AM_REG_ADC_SL1CFG_SLEN1_M                    0x00000001
#define AM_REG_ADC_SL1CFG_SLEN1(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL1CFG_SLEN1_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL2CFG - Slot 2 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL2CFG_ADSEL2_S                   24
#define AM_REG_ADC_SL2CFG_ADSEL2_M                   0x07000000
#define AM_REG_ADC_SL2CFG_ADSEL2(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL2CFG_ADSEL2_AVG_128_MSRMTS      0x07000000

// Select the track and hold delay for this slot.  NOTE: The track and hold
// delay must be less than 50us for correct operation.  When the ADC is
// configured to use the 1.5Mhz clock, the track and hold delay cannot exceed 64
// clocks.
#define AM_REG_ADC_SL2CFG_THSEL2_S                   16
#define AM_REG_ADC_SL2CFG_THSEL2_M                   0x00070000
#define AM_REG_ADC_SL2CFG_THSEL2(n)                  (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_ADC_SL2CFG_THSEL2_1_ADC_CLK           0x00000000
#define AM_REG_ADC_SL2CFG_THSEL2_2_ADC_CLKS          0x00010000
#define AM_REG_ADC_SL2CFG_THSEL2_4_ADC_CLKS          0x00020000
#define AM_REG_ADC_SL2CFG_THSEL2_8_ADC_CLKS          0x00030000
#define AM_REG_ADC_SL2CFG_THSEL2_16_ADC_CLKS         0x00040000
#define AM_REG_ADC_SL2CFG_THSEL2_32_ADC_CLKS         0x00050000
#define AM_REG_ADC_SL2CFG_THSEL2_64_ADC_CLKS         0x00060000
#define AM_REG_ADC_SL2CFG_THSEL2_128_ADC_CLKS        0x00070000

// Select one of the 13 channel inputs for this slot.
#define AM_REG_ADC_SL2CFG_CHSEL2_S                   8
#define AM_REG_ADC_SL2CFG_CHSEL2_M                   0x00000F00
#define AM_REG_ADC_SL2CFG_CHSEL2(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL2CFG_CHSEL2_EXT0                0x00000000
#define AM_REG_ADC_SL2CFG_CHSEL2_EXT1                0x00000100
#define AM_REG_ADC_SL2CFG_CHSEL2_EXT2                0x00000200
#define AM_REG_ADC_SL2CFG_CHSEL2_EXT3                0x00000300
#define AM_REG_ADC_SL2CFG_CHSEL2_EXT4                0x00000400
#define AM_REG_ADC_SL2CFG_CHSEL2_EXT5                0x00000500
#define AM_REG_ADC_SL2CFG_CHSEL2_EXT6                0x00000600
#define AM_REG_ADC_SL2CFG_CHSEL2_EXT7                0x00000700
#define AM_REG_ADC_SL2CFG_CHSEL2_TEMP                0x00000800
#define AM_REG_ADC_SL2CFG_CHSEL2_VDD                 0x00000900
#define AM_REG_ADC_SL2CFG_CHSEL2_VSS                 0x00000A00
#define AM_REG_ADC_SL2CFG_CHSEL2_VBATT               0x00000C00

// This bit enables the window compare function for slot 2.
#define AM_REG_ADC_SL2CFG_WCEN2_S                    1
#define AM_REG_ADC_SL2CFG_WCEN2_M                    0x00000002
#define AM_REG_ADC_SL2CFG_WCEN2(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL2CFG_WCEN2_WCEN                 0x00000002

// This bit enables slot 2 for ADC conversions.
#define AM_REG_ADC_SL2CFG_SLEN2_S                    0
#define AM_REG_ADC_SL2CFG_SLEN2_M                    0x00000001
#define AM_REG_ADC_SL2CFG_SLEN2(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL2CFG_SLEN2_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL3CFG - Slot 3 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL3CFG_ADSEL3_S                   24
#define AM_REG_ADC_SL3CFG_ADSEL3_M                   0x07000000
#define AM_REG_ADC_SL3CFG_ADSEL3(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL3CFG_ADSEL3_AVG_128_MSRMTS      0x07000000

// Select the track and hold delay for this slot.  NOTE: The track and hold
// delay must be less than 50us for correct operation.  When the ADC is
// configured to use the 1.5Mhz clock, the track and hold delay cannot exceed 64
// clocks.
#define AM_REG_ADC_SL3CFG_THSEL3_S                   16
#define AM_REG_ADC_SL3CFG_THSEL3_M                   0x00070000
#define AM_REG_ADC_SL3CFG_THSEL3(n)                  (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_ADC_SL3CFG_THSEL3_1_ADC_CLK           0x00000000
#define AM_REG_ADC_SL3CFG_THSEL3_2_ADC_CLKS          0x00010000
#define AM_REG_ADC_SL3CFG_THSEL3_4_ADC_CLKS          0x00020000
#define AM_REG_ADC_SL3CFG_THSEL3_8_ADC_CLKS          0x00030000
#define AM_REG_ADC_SL3CFG_THSEL3_16_ADC_CLKS         0x00040000
#define AM_REG_ADC_SL3CFG_THSEL3_32_ADC_CLKS         0x00050000
#define AM_REG_ADC_SL3CFG_THSEL3_64_ADC_CLKS         0x00060000
#define AM_REG_ADC_SL3CFG_THSEL3_128_ADC_CLKS        0x00070000

