AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_adc.h
// Select one of the 13 channel inputs for this slot.
#define AM_REG_ADC_SL3CFG_CHSEL3_S                   8
#define AM_REG_ADC_SL3CFG_CHSEL3_M                   0x00000F00
#define AM_REG_ADC_SL3CFG_CHSEL3(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL3CFG_CHSEL3_EXT0                0x00000000
#define AM_REG_ADC_SL3CFG_CHSEL3_EXT1                0x00000100
#define AM_REG_ADC_SL3CFG_CHSEL3_EXT2                0x00000200
#define AM_REG_ADC_SL3CFG_CHSEL3_EXT3                0x00000300
#define AM_REG_ADC_SL3CFG_CHSEL3_EXT4                0x00000400
#define AM_REG_ADC_SL3CFG_CHSEL3_EXT5                0x00000500
#define AM_REG_ADC_SL3CFG_CHSEL3_EXT6                0x00000600
#define AM_REG_ADC_SL3CFG_CHSEL3_EXT7                0x00000700
#define AM_REG_ADC_SL3CFG_CHSEL3_TEMP                0x00000800
#define AM_REG_ADC_SL3CFG_CHSEL3_VDD                 0x00000900
#define AM_REG_ADC_SL3CFG_CHSEL3_VSS                 0x00000A00
#define AM_REG_ADC_SL3CFG_CHSEL3_VBATT               0x00000C00

// This bit enables the window compare function for slot 3.
#define AM_REG_ADC_SL3CFG_WCEN3_S                    1
#define AM_REG_ADC_SL3CFG_WCEN3_M                    0x00000002
#define AM_REG_ADC_SL3CFG_WCEN3(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL3CFG_WCEN3_WCEN                 0x00000002

// This bit enables slot 3 for ADC conversions.
#define AM_REG_ADC_SL3CFG_SLEN3_S                    0
#define AM_REG_ADC_SL3CFG_SLEN3_M                    0x00000001
#define AM_REG_ADC_SL3CFG_SLEN3(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL3CFG_SLEN3_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL4CFG - Slot 4 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL4CFG_ADSEL4_S                   24
#define AM_REG_ADC_SL4CFG_ADSEL4_M                   0x07000000
#define AM_REG_ADC_SL4CFG_ADSEL4(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL4CFG_ADSEL4_AVG_128_MSRMTS      0x07000000

// Select the track and hold delay for this slot.  NOTE: The track and hold
// delay must be less than 50us for correct operation.  When the ADC is
// configured to use the 1.5Mhz clock, the track and hold delay cannot exceed 64
// clocks.
#define AM_REG_ADC_SL4CFG_THSEL4_S                   16
#define AM_REG_ADC_SL4CFG_THSEL4_M                   0x00070000
#define AM_REG_ADC_SL4CFG_THSEL4(n)                  (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_ADC_SL4CFG_THSEL4_1_ADC_CLK           0x00000000
#define AM_REG_ADC_SL4CFG_THSEL4_2_ADC_CLKS          0x00010000
#define AM_REG_ADC_SL4CFG_THSEL4_4_ADC_CLKS          0x00020000
#define AM_REG_ADC_SL4CFG_THSEL4_8_ADC_CLKS          0x00030000
#define AM_REG_ADC_SL4CFG_THSEL4_16_ADC_CLKS         0x00040000
#define AM_REG_ADC_SL4CFG_THSEL4_32_ADC_CLKS         0x00050000
#define AM_REG_ADC_SL4CFG_THSEL4_64_ADC_CLKS         0x00060000
#define AM_REG_ADC_SL4CFG_THSEL4_128_ADC_CLKS        0x00070000

// Select one of the 13 channel inputs for this slot.
#define AM_REG_ADC_SL4CFG_CHSEL4_S                   8
#define AM_REG_ADC_SL4CFG_CHSEL4_M                   0x00000F00
#define AM_REG_ADC_SL4CFG_CHSEL4(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL4CFG_CHSEL4_EXT0                0x00000000
#define AM_REG_ADC_SL4CFG_CHSEL4_EXT1                0x00000100
#define AM_REG_ADC_SL4CFG_CHSEL4_EXT2                0x00000200
#define AM_REG_ADC_SL4CFG_CHSEL4_EXT3                0x00000300
#define AM_REG_ADC_SL4CFG_CHSEL4_EXT4                0x00000400
#define AM_REG_ADC_SL4CFG_CHSEL4_EXT5                0x00000500
#define AM_REG_ADC_SL4CFG_CHSEL4_EXT6                0x00000600
#define AM_REG_ADC_SL4CFG_CHSEL4_EXT7                0x00000700
#define AM_REG_ADC_SL4CFG_CHSEL4_TEMP                0x00000800
#define AM_REG_ADC_SL4CFG_CHSEL4_VDD                 0x00000900
#define AM_REG_ADC_SL4CFG_CHSEL4_VSS                 0x00000A00
#define AM_REG_ADC_SL4CFG_CHSEL4_VBATT               0x00000C00

// This bit enables the window compare function for slot 4.
#define AM_REG_ADC_SL4CFG_WCEN4_S                    1
#define AM_REG_ADC_SL4CFG_WCEN4_M                    0x00000002
#define AM_REG_ADC_SL4CFG_WCEN4(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL4CFG_WCEN4_WCEN                 0x00000002

// This bit enables slot 4 for ADC conversions.
#define AM_REG_ADC_SL4CFG_SLEN4_S                    0
#define AM_REG_ADC_SL4CFG_SLEN4_M                    0x00000001
#define AM_REG_ADC_SL4CFG_SLEN4(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL4CFG_SLEN4_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL5CFG - Slot 5 Configuration Register
//
//*****************************************************************************
// Select number of measurements to average in the accumulate divide module for
// this slot.
#define AM_REG_ADC_SL5CFG_ADSEL5_S                   24
#define AM_REG_ADC_SL5CFG_ADSEL5_M                   0x07000000
#define AM_REG_ADC_SL5CFG_ADSEL5(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL5CFG_ADSEL5_AVG_128_MSRMTS      0x07000000

// Select track and hold delay for this slot.  NOTE: The track and hold delay
// must be less than 50us for correct operation.  When the ADC is configured to
// use the 1.5Mhz clock, the track and hold delay cannot exceed 64 clocks.
#define AM_REG_ADC_SL5CFG_THSEL5_S                   16
#define AM_REG_ADC_SL5CFG_THSEL5_M                   0x00070000
#define AM_REG_ADC_SL5CFG_THSEL5(n)                  (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_ADC_SL5CFG_THSEL5_1_ADC_CLK           0x00000000
#define AM_REG_ADC_SL5CFG_THSEL5_2_ADC_CLKS          0x00010000
#define AM_REG_ADC_SL5CFG_THSEL5_4_ADC_CLKS          0x00020000
#define AM_REG_ADC_SL5CFG_THSEL5_8_ADC_CLKS          0x00030000
#define AM_REG_ADC_SL5CFG_THSEL5_16_ADC_CLKS         0x00040000
#define AM_REG_ADC_SL5CFG_THSEL5_32_ADC_CLKS         0x00050000
#define AM_REG_ADC_SL5CFG_THSEL5_64_ADC_CLKS         0x00060000
#define AM_REG_ADC_SL5CFG_THSEL5_128_ADC_CLKS        0x00070000

