AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_adc.h
// Select one of the 13 channel inputs for this slot.
#define AM_REG_ADC_SL5CFG_CHSEL5_S                   8
#define AM_REG_ADC_SL5CFG_CHSEL5_M                   0x00000F00
#define AM_REG_ADC_SL5CFG_CHSEL5(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL5CFG_CHSEL5_EXT0                0x00000000
#define AM_REG_ADC_SL5CFG_CHSEL5_EXT1                0x00000100
#define AM_REG_ADC_SL5CFG_CHSEL5_EXT2                0x00000200
#define AM_REG_ADC_SL5CFG_CHSEL5_EXT3                0x00000300
#define AM_REG_ADC_SL5CFG_CHSEL5_EXT4                0x00000400
#define AM_REG_ADC_SL5CFG_CHSEL5_EXT5                0x00000500
#define AM_REG_ADC_SL5CFG_CHSEL5_EXT6                0x00000600
#define AM_REG_ADC_SL5CFG_CHSEL5_EXT7                0x00000700
#define AM_REG_ADC_SL5CFG_CHSEL5_TEMP                0x00000800
#define AM_REG_ADC_SL5CFG_CHSEL5_VDD                 0x00000900
#define AM_REG_ADC_SL5CFG_CHSEL5_VSS                 0x00000A00
#define AM_REG_ADC_SL5CFG_CHSEL5_VBATT               0x00000C00

// This bit enables the window compare function for slot 5.
#define AM_REG_ADC_SL5CFG_WCEN5_S                    1
#define AM_REG_ADC_SL5CFG_WCEN5_M                    0x00000002
#define AM_REG_ADC_SL5CFG_WCEN5(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL5CFG_WCEN5_WCEN                 0x00000002

// This bit enables slot 5 for ADC conversions.
#define AM_REG_ADC_SL5CFG_SLEN5_S                    0
#define AM_REG_ADC_SL5CFG_SLEN5_M                    0x00000001
#define AM_REG_ADC_SL5CFG_SLEN5(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL5CFG_SLEN5_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL6CFG - Slot 6 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL6CFG_ADSEL6_S                   24
#define AM_REG_ADC_SL6CFG_ADSEL6_M                   0x07000000
#define AM_REG_ADC_SL6CFG_ADSEL6(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL6CFG_ADSEL6_AVG_128_MSRMTS      0x07000000

// Select track and hold delay for this slot.  NOTE: The track and hold delay
// must be less than 50us for correct operation.  When the ADC is configured to
// use the 1.5Mhz clock, the track and hold delay cannot exceed 64 clocks.
#define AM_REG_ADC_SL6CFG_THSEL6_S                   16
#define AM_REG_ADC_SL6CFG_THSEL6_M                   0x00070000
#define AM_REG_ADC_SL6CFG_THSEL6(n)                  (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_ADC_SL6CFG_THSEL6_1_ADC_CLK           0x00000000
#define AM_REG_ADC_SL6CFG_THSEL6_2_ADC_CLKS          0x00010000
#define AM_REG_ADC_SL6CFG_THSEL6_4_ADC_CLKS          0x00020000
#define AM_REG_ADC_SL6CFG_THSEL6_8_ADC_CLKS          0x00030000
#define AM_REG_ADC_SL6CFG_THSEL6_16_ADC_CLKS         0x00040000
#define AM_REG_ADC_SL6CFG_THSEL6_32_ADC_CLKS         0x00050000
#define AM_REG_ADC_SL6CFG_THSEL6_64_ADC_CLKS         0x00060000
#define AM_REG_ADC_SL6CFG_THSEL6_128_ADC_CLKS        0x00070000

// Select one of the 13 channel inputs for this slot.
#define AM_REG_ADC_SL6CFG_CHSEL6_S                   8
#define AM_REG_ADC_SL6CFG_CHSEL6_M                   0x00000F00
#define AM_REG_ADC_SL6CFG_CHSEL6(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL6CFG_CHSEL6_EXT0                0x00000000
#define AM_REG_ADC_SL6CFG_CHSEL6_EXT1                0x00000100
#define AM_REG_ADC_SL6CFG_CHSEL6_EXT2                0x00000200
#define AM_REG_ADC_SL6CFG_CHSEL6_EXT3                0x00000300
#define AM_REG_ADC_SL6CFG_CHSEL6_EXT4                0x00000400
#define AM_REG_ADC_SL6CFG_CHSEL6_EXT5                0x00000500
#define AM_REG_ADC_SL6CFG_CHSEL6_EXT6                0x00000600
#define AM_REG_ADC_SL6CFG_CHSEL6_EXT7                0x00000700
#define AM_REG_ADC_SL6CFG_CHSEL6_TEMP                0x00000800
#define AM_REG_ADC_SL6CFG_CHSEL6_VDD                 0x00000900
#define AM_REG_ADC_SL6CFG_CHSEL6_VSS                 0x00000A00
#define AM_REG_ADC_SL6CFG_CHSEL6_VBATT               0x00000C00

// This bit enables the window compare function for slot 6.
#define AM_REG_ADC_SL6CFG_WCEN6_S                    1
#define AM_REG_ADC_SL6CFG_WCEN6_M                    0x00000002
#define AM_REG_ADC_SL6CFG_WCEN6(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL6CFG_WCEN6_WCEN                 0x00000002

// This bit enables slot 6 for ADC conversions.
#define AM_REG_ADC_SL6CFG_SLEN6_S                    0
#define AM_REG_ADC_SL6CFG_SLEN6_M                    0x00000001
#define AM_REG_ADC_SL6CFG_SLEN6(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL6CFG_SLEN6_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_SL7CFG - Slot 7 Configuration Register
//
//*****************************************************************************
// Select the number of measurements to average in the accumulate divide module
// for this slot.
#define AM_REG_ADC_SL7CFG_ADSEL7_S                   24
#define AM_REG_ADC_SL7CFG_ADSEL7_M                   0x07000000
#define AM_REG_ADC_SL7CFG_ADSEL7(n)                  (((uint32_t)(n) << 24) & 0x07000000)
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_1_MSRMT         0x00000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_2_MSRMTS        0x01000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_4_MSRMTS        0x02000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_8_MSRMT         0x03000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_16_MSRMTS       0x04000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_32_MSRMTS       0x05000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_64_MSRMTS       0x06000000
#define AM_REG_ADC_SL7CFG_ADSEL7_AVG_128_MSRMTS      0x07000000

// Select track and hold delay for this slot.  NOTE: The track and hold delay
// must be less than 50us for correct operation.  When the ADC is configured to
// use the 1.5Mhz clock, the track and hold delay cannot exceed 64 clocks.
#define AM_REG_ADC_SL7CFG_THSEL7_S                   16
#define AM_REG_ADC_SL7CFG_THSEL7_M                   0x00070000
#define AM_REG_ADC_SL7CFG_THSEL7(n)                  (((uint32_t)(n) << 16) & 0x00070000)
#define AM_REG_ADC_SL7CFG_THSEL7_1_ADC_CLK           0x00000000
#define AM_REG_ADC_SL7CFG_THSEL7_2_ADC_CLKS          0x00010000
#define AM_REG_ADC_SL7CFG_THSEL7_4_ADC_CLKS          0x00020000
#define AM_REG_ADC_SL7CFG_THSEL7_8_ADC_CLKS          0x00030000
#define AM_REG_ADC_SL7CFG_THSEL7_16_ADC_CLKS         0x00040000
#define AM_REG_ADC_SL7CFG_THSEL7_32_ADC_CLKS         0x00050000
#define AM_REG_ADC_SL7CFG_THSEL7_64_ADC_CLKS         0x00060000
#define AM_REG_ADC_SL7CFG_THSEL7_128_ADC_CLKS        0x00070000

