AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_adc.h
// Select one of the 13 channel inputs for this slot.
#define AM_REG_ADC_SL7CFG_CHSEL7_S                   8
#define AM_REG_ADC_SL7CFG_CHSEL7_M                   0x00000F00
#define AM_REG_ADC_SL7CFG_CHSEL7(n)                  (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_ADC_SL7CFG_CHSEL7_EXT0                0x00000000
#define AM_REG_ADC_SL7CFG_CHSEL7_EXT1                0x00000100
#define AM_REG_ADC_SL7CFG_CHSEL7_EXT2                0x00000200
#define AM_REG_ADC_SL7CFG_CHSEL7_EXT3                0x00000300
#define AM_REG_ADC_SL7CFG_CHSEL7_EXT4                0x00000400
#define AM_REG_ADC_SL7CFG_CHSEL7_EXT5                0x00000500
#define AM_REG_ADC_SL7CFG_CHSEL7_EXT6                0x00000600
#define AM_REG_ADC_SL7CFG_CHSEL7_EXT7                0x00000700
#define AM_REG_ADC_SL7CFG_CHSEL7_TEMP                0x00000800
#define AM_REG_ADC_SL7CFG_CHSEL7_VDD                 0x00000900
#define AM_REG_ADC_SL7CFG_CHSEL7_VSS                 0x00000A00
#define AM_REG_ADC_SL7CFG_CHSEL7_VBATT               0x00000C00

// This bit enables the window compare function for slot 7.
#define AM_REG_ADC_SL7CFG_WCEN7_S                    1
#define AM_REG_ADC_SL7CFG_WCEN7_M                    0x00000002
#define AM_REG_ADC_SL7CFG_WCEN7(n)                   (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_ADC_SL7CFG_WCEN7_WCEN                 0x00000002

// This bit enables slot 7 for ADC conversions.
#define AM_REG_ADC_SL7CFG_SLEN7_S                    0
#define AM_REG_ADC_SL7CFG_SLEN7_M                    0x00000001
#define AM_REG_ADC_SL7CFG_SLEN7(n)                   (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_ADC_SL7CFG_SLEN7_SLEN                 0x00000001

//*****************************************************************************
//
// ADC_WLIM - Window Comparator Limits Register
//
//*****************************************************************************
// Sets the upper limit for the wondow comparator.
#define AM_REG_ADC_WLIM_ULIM_S                       16
#define AM_REG_ADC_WLIM_ULIM_M                       0xFFFF0000
#define AM_REG_ADC_WLIM_ULIM(n)                      (((uint32_t)(n) << 16) & 0xFFFF0000)

// Sets the lower limit for the wondow comparator.
#define AM_REG_ADC_WLIM_LLIM_S                       0
#define AM_REG_ADC_WLIM_LLIM_M                       0x0000FFFF
#define AM_REG_ADC_WLIM_LLIM(n)                      (((uint32_t)(n) << 0) & 0x0000FFFF)

//*****************************************************************************
//
// ADC_FIFO - FIFO Data and Valid Count Register
//
//*****************************************************************************
// RESERVED.
#define AM_REG_ADC_FIFO_RSVD_27_S                    27
#define AM_REG_ADC_FIFO_RSVD_27_M                    0xF8000000
#define AM_REG_ADC_FIFO_RSVD_27(n)                   (((uint32_t)(n) << 27) & 0xF8000000)

// Slot number associated with this FIFO data.
#define AM_REG_ADC_FIFO_SLOTNUM_S                    24
#define AM_REG_ADC_FIFO_SLOTNUM_M                    0x07000000
#define AM_REG_ADC_FIFO_SLOTNUM(n)                   (((uint32_t)(n) << 24) & 0x07000000)

// RESERVED.
#define AM_REG_ADC_FIFO_RSVD_20_S                    20
#define AM_REG_ADC_FIFO_RSVD_20_M                    0x00F00000
#define AM_REG_ADC_FIFO_RSVD_20(n)                   (((uint32_t)(n) << 20) & 0x00F00000)

// Number of valid entries in the ADC FIFO.
#define AM_REG_ADC_FIFO_COUNT_S                      16
#define AM_REG_ADC_FIFO_COUNT_M                      0x000F0000
#define AM_REG_ADC_FIFO_COUNT(n)                     (((uint32_t)(n) << 16) & 0x000F0000)

// Oldest data in the FIFO.
#define AM_REG_ADC_FIFO_DATA_S                       0
#define AM_REG_ADC_FIFO_DATA_M                       0x0000FFFF
#define AM_REG_ADC_FIFO_DATA(n)                      (((uint32_t)(n) << 0) & 0x0000FFFF)

#endif // AM_REG_ADC_H
